example/call.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" >
	<s:Body>
		<u:AddMessage xmlns:u="urn:samsung.com:service:MessageBoxService:1">
			<MessageID>1</MessageID>
			<MessageType>text/xml</MessageType>
				<Message>
				&lt;Category&gt;Incoming Call&lt;/Category&gt;
				&lt;DisplayType&gt;Maximum&lt;/DisplayType&gt;
&lt;CallTime&gt;
   &lt;Date&gt;2012-04-07&lt;/Date&gt;		
   &lt;Time&gt;17:30:00&lt;/Time&gt;		
 &lt;/CallTime&gt;
 &lt;Callee&gt;
   &lt;Number&gt;310-555-1212&lt;/Number&gt;
   &lt;Name&gt;Callee Name&lt;/Name&gt;
 &lt;/Callee&gt;
 &lt;Caller&gt;
   &lt;Number&gt;310-555-2323&lt;/Number&gt;
   &lt;Name&gt;Caller Name&lt;/Name&gt;
 &lt;/Caller&gt;
				</Message>
		</u:AddMessage>
	</s:Body>
</s:Envelope>